# import libs

In [1]:
import os
import pandas as pd
from datetime import datetime, timedelta

from sqlalchemy import create_engine, text

import random
from faker import Faker

# connection

In [2]:
# строка подключения
engine = create_engine("postgresql+psycopg2://test_user:test_pass@localhost:5432/test_db")

# список таблиц
with engine.connect() as conn:
    df = pd.read_sql("SELECT table_name FROM information_schema.tables WHERE table_schema='public';", conn)
df

                    table_name
0                 dim_channels
1                dim_campaigns
2                dim_templates
3   dim_communication_statuses
4      campaign_communications
5                       events
6                 sessions_log
7                   dim_events
8                transaction_f
9              dim_application
10                 fact_events

# mock-data seed

In [3]:
# reproducibility
random.seed(42)
Faker.seed(42)
fake = Faker()

# подключение к БД
engine = create_engine("postgresql+psycopg2://test_user:test_pass@localhost:5432/test_db")

# ---------- dim_channels ----------
channels = [
    {"id": 1, "name": "SMS", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2099-12-31"},
    {"id": 2, "name": "Email", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2099-12-31"},
    {"id": 3, "name": "PUSH", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2023-10-31"},
    {"id": 4, "name": "PUSH", "row_actual_from_ts": "2023-11-01", "row_actual_to": "2099-12-31"},
]
pd.DataFrame(channels).to_sql("dim_channels", engine, if_exists="replace", index=False)

# ---------- dim_campaigns ----------
campaigns = []
for i in range(1, 100):
    start = fake.date_time_between_dates(
    datetime_start=datetime(2023,1,1), datetime_end=datetime(2023,12,31)
    )
    campaigns.append({
        "id": i,
        "campaign_name": f"Campaign_{i}",
        "started_ts": start,
        "ended_ts": start + timedelta(days=random.randint(3,10)),
        "channel_id": random.choice([1,2,3,4])
    })
pd.DataFrame(campaigns).to_sql("dim_campaigns", engine, if_exists="replace", index=False)

# ---------- dim_templates ----------
templates = []
for i in range(1, 11):
    start = fake.date_time_between_dates(
        datetime_start=datetime(2020,1,1), datetime_end=datetime(2022,12,31)
    )
    templates.append({
        "id": i,
        "channel_id": random.choice([1,2,3,4]),
        "template_text": fake.sentence(),
        "row_actual_from_ts": start,
        "row_actual_to": "2099-12-31"
    })
pd.DataFrame(templates).to_sql("dim_templates", engine, if_exists="replace", index=False)

# ---------- dim_communication_statuses ----------
statuses = [
    {"id": 1, "status_name": "error"},
    {"id": 2, "status_name": "unsent"},
    {"id": 3, "status_name": "sent"},
    {"id": 4, "status_name": "delivered"},
    {"id": 5, "status_name": "read"},
]
df_status = pd.DataFrame(statuses)
df_status["row_actual_from"] = "2000-01-01"
df_status["row_actual_to"] = "2099-12-31"
df_status.to_sql("dim_communication_statuses", engine, if_exists="replace", index=False)

# ---------- campaign_communications ----------
comms = []
for i in range(1, 100000):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,6,1), datetime_end=datetime(2023,12,31)
    )
    comms.append({
        "id": i,
        "communication_id": random.randint(100000, 999999),
        "campaign_id": random.choice(range(1,100)),
        "status_ts": ts,
        "user_id": random.randint(10000, 99999),
        "communication_status_id": random.choice([1,2,3,4,5])
    })
pd.DataFrame(comms).to_sql("campaign_communications", engine, if_exists="replace", index=False)
first_task_tables = [
    'dim_channels',
    'dim_campaigns',
    'campaign_communications',
    'dim_communication_statuses',
    'dim_templates',
]

# ---------- events ----------
events = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,11,1), datetime_end=datetime(2023,11,5)
    )
    events.append({
        "user_id": random.randint(1,10),
        "event_type": random.choice(["authorization", "scroll", "calculator", "push_button"]),
        "event_time": ts
    })
pd.DataFrame(events).to_sql("events", engine, if_exists="replace", index=False)

# ---------- sessions_log ----------
logs = []
for i in range(1, 5001):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,11,1), datetime_end=datetime(2023,12,31)
    )
    logs.append({
        "id": i,
        "session_id": random.randint(1,50),
        "user_id": random.randint(1,5),
        "event_id": random.choice(range(1,21)),
        "time_stamp": ts
    })
pd.DataFrame(logs).to_sql("sessions_log", engine, if_exists="replace", index=False)

# ---------- dim_events ----------
dim_ev = []
for i in range(1, 21):
    dim_ev.append({
        "id": i,
        "event_name": fake.word(),
        "row_actual_from": "2000-01-01",
        "row_actual_to": "2099-12-31"
    })
pd.DataFrame(dim_ev).to_sql("dim_events", engine, if_exists="replace", index=False)

# ---------- transaction_f ----------
transactions = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,5,1), datetime_end=datetime(2023,12,31)
    )
    transactions.append({
        "id": i,
        "created_ts": ts,
        "client_key": random.randint(1000,1200),
        "amount": round(random.uniform(10, 5000), 2),
        "application_id": random.choice([12,13])
    })
pd.DataFrame(transactions).to_sql("transaction_f", engine, if_exists="replace", index=False)

# ---------- dim_application ----------
apps = [
    {"id": 1, "application_id": 12, "application_name": "Taxi", "row_actual_from": "2023-01-01", "row_actual_to": "2099-12-31"},
    {"id": 2, "application_id": 13, "application_name": "SuperAppPlus", "row_actual_from": "2023-01-01", "row_actual_to": "2099-12-31"},
]
pd.DataFrame(apps).to_sql("dim_application", engine, if_exists="replace", index=False)

# ---------- fact_events ----------
facts = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,7,1), datetime_end=datetime(2023,12,31)
    )
    facts.append({
        "id": i,
        "event_ts": ts,
        "user_id": f"{random.randint(1000,2000)}",
        "business_domain": random.choice(["Taxi","SuperApp","Market"]),
        "client_id": random.choice(["desktop","mobile"]),
        "event_name": fake.word()
    })
pd.DataFrame(facts).to_sql("fact_events", engine, if_exists="replace", index=False)

print("✅ Mock data generated with fixed seed & reproducible dates")

✅ Mock data generated with fixed seed & reproducible dates

In [4]:
def display_tables(table_list:list):
    for table in table_list:
        tmp = pd.read_sql(f'select * from {table}', engine)
        print(table, tmp.shape)
        display(tmp.head(5))
        # display(.tail(5))

# Task: 1

In [5]:
display_tables(first_task_tables)

dim_channels (4, 4)

   id   name row_actual_from_ts row_actual_to
0   1    SMS         2000-01-01    2099-12-31
1   2  Email         2000-01-01    2099-12-31
2   3   PUSH         2000-01-01    2023-10-31
3   4   PUSH         2023-11-01    2099-12-31

dim_campaigns (99, 5)

,id,campaign_name,started_ts,ended_ts,channel_id
0,1,Campaign_1,2023-08-21 18:01:57.040781,2023-08-25 18:01:57.040781,1
1,2,Campaign_2,2023-01-10 02:29:38.247451,2023-01-17 02:29:38.247451,2
2,3,Campaign_3,2023-04-11 02:39:22.050982,2023-04-17 02:39:22.050982,2
3,4,Campaign_4,2023-03-23 05:58:08.430485,2023-03-27 05:58:08.430485,1
4,5,Campaign_5,2023-09-26 01:48:45.096972,2023-10-05 01:48:45.096972,1

campaign_communications (99999, 6)

,id,communication_id,campaign_id,status_ts,user_id,communication_status_id
0,1,324130,52,2023-09-09 16:17:39.431421,17685,2
1,2,497382,1,2023-11-15 02:58:28.189108,61173,3
2,3,922157,59,2023-11-19 23:55:28.749299,47388,4
3,4,830429,94,2023-07-11 13:22:31.735985,82845,4
4,5,262316,25,2023-06-21 15:30:37.160416,48890,2

dim_communication_statuses (5, 4)

   id status_name row_actual_from row_actual_to
0   1       error      2000-01-01    2099-12-31
1   2      unsent      2000-01-01    2099-12-31
2   3        sent      2000-01-01    2099-12-31
3   4   delivered      2000-01-01    2099-12-31
4   5        read      2000-01-01    2099-12-31

dim_templates (10, 5)

,id,channel_id,template_text,row_actual_from_ts,row_actual_to
0,1,4,Quite boy those.,2022-07-31 13:17:26.069001,2099-12-31
1,2,1,Born itself law west then enjoy.,2022-04-02 05:04:06.863763,2099-12-31
2,3,1,Medical blood personal success.,2021-07-02 03:24:10.983463,2099-12-31
3,4,1,Check several much single morning.,2021-07-09 21:22:49.938140,2099-12-31
4,5,1,Major born guy world southern dream.,2020-01-01 15:01:45.948873,2099-12-31

Определить процент доставляемости  PUSH-рассылок в рекламных кампаниях запущенных за 3-4 кварталы 2023 года.  В журнал пишутся все статусы по каждой коммуникации
- По каждой кампании (кампания, дата старта кампании, % успешных доставок (delivered))

In [6]:
query1_1 = text("""
WITH channels_q AS (
    SELECT id, name
    FROM dim_channels
    WHERE name = 'PUSH'
),

campaigns_q AS (
    SELECT 
        id, 
        campaign_name, 
        started_ts, 
        channel_id
    FROM dim_campaigns
    WHERE started_ts BETWEEN '2023-07-01' AND '2023-12-31'
),

communications_q AS (
    SELECT 
        communication_id, 
        campaign_id, 
        communication_status_id
    FROM campaign_communications
),

statuses_q AS (
    SELECT 
        id, 
        status_name
    FROM dim_communication_statuses
)

SELECT
    campaigns_q.campaign_name,
    campaigns_q.started_ts::date,
    ROUND(
        SUM(CASE WHEN statuses_q.status_name = 'delivered' THEN 1 ELSE 0 END) 
        * 100.0 / 
        NULLIF(COUNT(DISTINCT communications_q.communication_id), 0),
        2
    ) AS delivered_percent
FROM campaigns_q
JOIN channels_q ON campaigns_q.channel_id = channels_q.id
LEFT JOIN communications_q ON campaigns_q.id = communications_q.campaign_id
LEFT JOIN statuses_q ON communications_q.communication_status_id = statuses_q.id
GROUP BY campaigns_q.campaign_name, campaigns_q.started_ts
ORDER BY campaigns_q.started_ts;
""")

df1_1 = pd.read_sql(query1_1, engine)
df1_1

   campaign_name  started_ts  delivered_percent
0    Campaign_12  2023-07-03              19.77
1    Campaign_98  2023-07-12              19.69
2    Campaign_33  2023-07-15              19.64
3    Campaign_36  2023-07-20              20.00
4    Campaign_40  2023-07-30              21.92
5    Campaign_83  2023-08-01              21.52
6    Campaign_56  2023-08-10              20.26
7    Campaign_49  2023-08-20              20.89
8    Campaign_62  2023-08-21              17.80
9    Campaign_55  2023-08-24              20.54
10   Campaign_64  2023-09-07              19.11
11   Campaign_32  2023-09-23              20.61
12   Campaign_93  2023-10-16              19.07
13   Campaign_21  2023-10-21              21.12
14   Campaign_37  2023-10-29              17.59
15   Campaign_73  2023-11-15              21.46
16   Campaign_72  2023-12-10              20.13
17   Campaign_34  2023-12-21              17.66

- В среднем по каналу за каждый месяц (месяц, % успешных доставок) <br>
За каждый месяц чего? Старта кампании или отправки коммуникации?

In [7]:
query1_2 = text("""
WITH campaigns_q AS (
    SELECT
        id,
        campaign_name,
        started_ts,
        channel_id
    FROM dim_campaigns
    WHERE started_ts BETWEEN '2023-07-01' AND '2023-12-31'
),

channels_q AS (
    SELECT
        id,
        name
    FROM dim_channels
    WHERE name = 'PUSH'
),

statuses_q AS (
    SELECT
        id,
        status_name
    FROM dim_communication_statuses
),

communications_q AS (
    SELECT
        communication_id,
        campaign_id,
        communication_status_id,
        status_ts
    FROM campaign_communications
),

joined AS (
    SELECT
        DATE_TRUNC('month', communications_q.status_ts) AS month,
        channels_q.id AS channel_id,
        channels_q.name AS channel_name,
        ROUND(
            100.0 * SUM(
                CASE WHEN statuses_q.status_name = 'delivered' THEN 1 ELSE 0 END
            ) / NULLIF(COUNT(DISTINCT communications_q.communication_id), 0),
            2
        ) AS delivered_percent
    FROM campaigns_q
    JOIN channels_q
        ON campaigns_q.channel_id = channels_q.id
    LEFT JOIN communications_q
        ON communications_q.campaign_id = campaigns_q.id
    LEFT JOIN statuses_q
        ON communications_q.communication_status_id = statuses_q.id
    GROUP BY
        DATE_TRUNC('month', communications_q.status_ts),
        channels_q.id,
        channels_q.name
)

SELECT
    joined.month,
    joined.channel_id,
    joined.channel_name,
    joined.delivered_percent
FROM joined
ORDER BY
    joined.channel_id,
    joined.month;
""")

df1_2 = pd.read_sql(query1_2, engine)
df1_2

        month  channel_id channel_name  delivered_percent
0  2023-06-01           3         PUSH              20.09
1  2023-07-01           3         PUSH              18.95
2  2023-08-01           3         PUSH              18.59
3  2023-09-01           3         PUSH              19.56
4  2023-10-01           3         PUSH              21.43
5  2023-11-01           3         PUSH              19.29
6  2023-12-01           3         PUSH              20.26
7  2023-06-01           4         PUSH              21.40
8  2023-07-01           4         PUSH              20.63
9  2023-08-01           4         PUSH              19.11
10 2023-09-01           4         PUSH              18.47
11 2023-10-01           4         PUSH              19.96
12 2023-11-01           4         PUSH              21.07
13 2023-12-01           4         PUSH              21.11

# Task: 2

In [8]:
display_tables(['events'])

events (500, 3)

   user_id     event_type                 event_time
0        7     calculator 2023-11-02 21:34:46.386566
1        5     calculator 2023-11-01 21:16:32.770094
2       10  authorization 2023-11-02 15:54:01.121487
3        3    push_button 2023-11-04 15:09:31.967939
4        2     calculator 2023-11-03 00:08:51.272965

Определить сессии пользователя по следующим условиям. Сессией считается последовательность действий пользователя, где разница во времени между последовательными событиями меньше или равна 30 минутам. Если время между двумя событиями превышает 30 минут, это считается началом новой сессии.

Для каждой сессии вычислите следующие колонки:
- session_id : уникальный идентификатор для каждой сессии.
- session_start_time : временная метка первого события в сессии.
- session_end_time : временная метка последнего события в сессии.
- session_duration : разница между session_end_time и session_start_time.
- event_count : количество событий в сессии.

In [9]:
query2 = text("""
WITH events_sorted AS (
    SELECT
        user_id,
        event_time,
        LAG(event_time) OVER (
            PARTITION BY user_id
            ORDER BY event_time
        ) AS prev_time
    FROM events
),

sessions AS (
    SELECT
        user_id,
        event_time,
        CASE
            WHEN prev_time IS NULL
                 OR event_time - prev_time > INTERVAL '30 minutes'
            THEN 1 ELSE 0
        END AS is_new_session
    FROM events_sorted
),

session_marks AS (
    SELECT
        user_id,
        event_time,
        SUM(is_new_session) OVER (
            PARTITION BY user_id
            ORDER BY event_time
        ) AS session_number
    FROM sessions
)

SELECT
    user_id,
    MD5(user_id::text || '-' || session_number::text) AS session_id,
    MIN(event_time) AS session_start_time,
    MAX(event_time) AS session_end_time,
    ROUND(
        EXTRACT(EPOCH FROM (MAX(event_time) - MIN(event_time))) / 60,
        2
    ) AS session_duration_minutes,
    COUNT(*) AS event_count
FROM session_marks
GROUP BY
    user_id,
    session_number
HAVING
    COUNT(*) > 1
ORDER BY
    user_id,
    session_start_time;
""")

df2 = pd.read_sql(query2, engine)
df2.head(10)

,user_id,session_id,session_start_time,session_end_time,session_duration_minutes,event_count
0,1,98c6f2c2287f4c73cea3d40ae7ec3ff2,2023-11-01 06:28:53.438846,2023-11-01 06:51:45.266669,22.86,2
1,1,3a170a9fe4f47efa37d23ad521b9098e,2023-11-01 08:41:15.179788,2023-11-01 08:57:05.747966,15.84,3
2,1,c5c24ffa1360c8802a8de01cd827581d,2023-11-02 02:05:21.647018,2023-11-02 02:17:21.144665,11.99,2
3,1,fb1535263ec1463f647d00436fb81399,2023-11-02 12:47:55.027304,2023-11-02 13:11:24.107919,23.48,2
4,1,e7ca6fb660a6ff44e15f7bf3a7038848,2023-11-03 13:18:27.025186,2023-11-03 13:57:58.710734,39.53,4
5,1,1c675220c2a82b064f5f5c6d32147097,2023-11-03 20:52:07.194705,2023-11-03 21:11:53.981511,19.78,2
6,1,2adc50f0edaed1b908324628e4f972ad,2023-11-04 01:32:00.191772,2023-11-04 02:38:33.015430,66.55,5
7,1,25a7d2ac6223606e511fa088a5b3c8a1,2023-11-04 10:59:10.859274,2023-11-04 11:14:16.554841,15.09,2
8,1,e6dbd232ea6a4df22156ff10746364a1,2023-11-04 16:04:29.832605,2023-11-04 16:09:05.331144,4.59,2
9,2,5569d6a77276c38e4e5891bd92577c63,2023-11-01 11:17:37.201936,2023-11-01 11:17:56.609743,0.32,2

# Task: 3

In [10]:
display_tables(['sessions_log','dim_events'])

sessions_log (5000, 5)

   id  session_id  user_id  event_id                 time_stamp
0   1          41        2        13 2023-12-26 16:29:46.654368
1   2          35        1        15 2023-11-10 04:54:18.880170
2   3          32        2         1 2023-12-26 05:10:55.867891
3   4          30        1        19 2023-11-23 23:55:13.190410
4   5          49        2        12 2023-11-14 05:53:06.590344

dim_events (20, 4)

   id  event_name row_actual_from row_actual_to
0   1        next      2000-01-01    2099-12-31
1   2        hour      2000-01-01    2099-12-31
2   3        stop      2000-01-01    2099-12-31
3   4  collection      2000-01-01    2099-12-31
4   5       clear      2000-01-01    2099-12-31

Определить за каждую неделю с 1 мая 2023 года топ 10 событий, на которых заканчиваются пользовательские сессии.

In [11]:
query3 = text("""
WITH last_events AS (
    SELECT
        sessions_log.session_id,
        sessions_log.user_id,
        sessions_log.event_id,
        sessions_log.time_stamp,
        ROW_NUMBER() OVER (
            PARTITION BY sessions_log.user_id, sessions_log.session_id
            ORDER BY sessions_log.time_stamp DESC
        ) AS rn
    FROM sessions_log
    WHERE sessions_log.time_stamp >= '2023-05-01'
),

ranked AS (
    SELECT
        DATE_TRUNC('week', last_events.time_stamp) AS week_start,
        dim_events.event_name,
        COUNT(*) AS event_count,
        ROW_NUMBER() OVER (
            PARTITION BY DATE_TRUNC('week', last_events.time_stamp)
            ORDER BY COUNT(*) DESC
        ) AS rank_in_week
    FROM last_events
    JOIN dim_events
        ON last_events.event_id = dim_events.id
    WHERE last_events.rn = 1
    GROUP BY
        DATE_TRUNC('week', last_events.time_stamp),
        dim_events.event_name
    HAVING
        COUNT(*) > 0
)

SELECT
    ranked.week_start,
    ranked.event_name,
    ranked.event_count,
    ranked.rank_in_week
FROM ranked
WHERE ranked.rank_in_week <= 10
ORDER BY
    ranked.week_start,
    ranked.rank_in_week;
""")

df3 = pd.read_sql(query3, engine)
print(df3.shape)
df3

(25, 4)

   week_start  event_name  event_count  rank_in_week
0  2023-12-04       reach            1             1
1  2023-12-04  collection            1             2
2  2023-12-11  collection            1             1
3  2023-12-11       where            1             2
4  2023-12-11        next            1             3
5  2023-12-18          do            3             1
6  2023-12-18  population            2             2
7  2023-12-18        card            2             3
8  2023-12-18        draw            2             4
9  2023-12-18    everyone            2             5
10 2023-12-18      arrive            2             6
11 2023-12-18       would            2             7
12 2023-12-18    property            1             8
13 2023-12-18  collection            1             9
14 2023-12-18        last            1            10
15 2023-12-25      arrive           16             1
16 2023-12-25       would           15             2
17 2023-12-25       cover           15             3
18 2023-12-25       where           14             4
19 2023-12-25        last           14             5
20 2023-12-25      result           13             6
21 2023-12-25  collection           12             7
22 2023-12-25        draw           12             8
23 2023-12-25        hour           12             9
24 2023-12-25  population           12            10

# Task: 4

In [12]:
display_tables(['transaction_f','dim_application'])

transaction_f (500, 5)

   id                 created_ts  client_key   amount  application_id
0   1 2023-05-28 08:57:04.562303        1108  4936.64              12
1   2 2023-07-03 19:20:46.650459        1091   370.23              13
2   3 2023-06-10 13:47:23.549616        1001  4501.57              13
3   4 2023-06-20 03:19:34.361422        1023  1091.98              13
4   5 2023-12-05 06:06:29.440037        1137  2173.15              12

dim_application (2, 5)

   id  application_id application_name row_actual_from row_actual_to
0   1              12             Taxi      2023-01-01    2099-12-31
1   2              13     SuperAppPlus      2023-01-01    2099-12-31

Посчитать накопительно (кумулятивно) на каждый день за май 2023  (c 1 по 31) сумму транзакций:
- по каждому клиенту

In [13]:
query4_1 = text("""
WITH daily AS (
    SELECT
        client_key,
        DATE(created_ts) AS dt,
        SUM(amount) AS daily_amount
    FROM transaction_f
    WHERE created_ts BETWEEN '2023-05-01' AND '2023-05-31'
    GROUP BY client_key, DATE(created_ts)
)
SELECT
    client_key,
    dt,
    SUM(daily_amount) OVER (PARTITION BY client_key ORDER BY dt) AS cumulative_sum
FROM daily
ORDER BY client_key, dt;
""")

df4_clients = pd.read_sql(query4_1, engine)
df4_clients.head(20)

    client_key          dt  cumulative_sum
0         1000  2023-05-04          842.84
1         1002  2023-05-23         2981.81
2         1004  2023-05-05         1367.57
3         1004  2023-05-13         3206.40
4         1009  2023-05-03          691.07
5         1012  2023-05-05          289.28
6         1020  2023-05-30         4626.12
7         1027  2023-05-27          437.37
8         1034  2023-05-30         1232.44
9         1036  2023-05-03         4470.84
10        1036  2023-05-11         6720.99
11        1036  2023-05-25         9784.07
12        1037  2023-05-12         1361.25
13        1039  2023-05-17         3637.92
14        1044  2023-05-09          763.79
15        1046  2023-05-05         2364.41
16        1048  2023-05-27         2769.91
17        1049  2023-05-22         3892.42
18        1050  2023-05-15           67.91
19        1059  2023-05-13         1552.33

- по каждому  приложению (с названием приложения)

In [14]:
query4_2 = text("""
WITH dates AS (
    SELECT
        generate_series(
            DATE '2023-05-01',
            DATE '2023-05-31',
            INTERVAL '1 day'
        )::date AS dt
),

apps AS (
    SELECT DISTINCT
        dim_application.application_id,
        dim_application.application_name
    FROM dim_application
),

calendar AS (
    SELECT
        apps.application_id,
        apps.application_name,
        dates.dt
    FROM apps
    CROSS JOIN dates
),

daily AS (
    SELECT
        transaction_f.application_id,
        DATE(transaction_f.created_ts) AS dt,
        SUM(transaction_f.amount) AS daily_amount
    FROM transaction_f
    WHERE transaction_f.created_ts BETWEEN '2023-05-01' AND '2023-05-31'
    GROUP BY
        transaction_f.application_id,
        DATE(transaction_f.created_ts)
)

SELECT
    calendar.application_name,
    calendar.dt,
    SUM(COALESCE(daily.daily_amount, 0)) OVER (
        PARTITION BY calendar.application_name
        ORDER BY calendar.dt
    ) AS cumulative_sum
FROM calendar
LEFT JOIN daily
    ON calendar.application_id = daily.application_id
   AND calendar.dt = daily.dt
ORDER BY
    calendar.application_name,
    calendar.dt;
""")

df4_apps = pd.read_sql(query4_2, engine)
display(df4_apps.head(31), df4_apps.tail(31))

   application_name          dt  cumulative_sum
0      SuperAppPlus  2023-05-01            0.00
1      SuperAppPlus  2023-05-02            0.00
2      SuperAppPlus  2023-05-03         3991.13
3      SuperAppPlus  2023-05-04         3991.13
4      SuperAppPlus  2023-05-05        10414.72
5      SuperAppPlus  2023-05-06        10414.72
6      SuperAppPlus  2023-05-07        10643.59
7      SuperAppPlus  2023-05-08        10643.59
8      SuperAppPlus  2023-05-09        10643.59
9      SuperAppPlus  2023-05-10        14628.94
10     SuperAppPlus  2023-05-11        20945.76
11     SuperAppPlus  2023-05-12        21437.49
12     SuperAppPlus  2023-05-13        21881.52
13     SuperAppPlus  2023-05-14        21911.02
14     SuperAppPlus  2023-05-15        21911.02
15     SuperAppPlus  2023-05-16        21911.02
16     SuperAppPlus  2023-05-17        25548.94
17     SuperAppPlus  2023-05-18        26585.50
18     SuperAppPlus  2023-05-19        26585.50
19     SuperAppPlus  2023-05-20        29470.78
20     SuperAppPlus  2023-05-21        34211.06
21     SuperAppPlus  2023-05-22        34211.06
22     SuperAppPlus  2023-05-23        34455.62
23     SuperAppPlus  2023-05-24        38264.30
24     SuperAppPlus  2023-05-25        47035.07
25     SuperAppPlus  2023-05-26        49212.56
26     SuperAppPlus  2023-05-27        49212.56
27     SuperAppPlus  2023-05-28        54208.83
28     SuperAppPlus  2023-05-29        54208.83
29     SuperAppPlus  2023-05-30        56875.65
30     SuperAppPlus  2023-05-31        56875.65

   application_name          dt  cumulative_sum
31             Taxi  2023-05-01            0.00
32             Taxi  2023-05-02          678.53
33             Taxi  2023-05-03         6759.12
34             Taxi  2023-05-04        15354.21
35             Taxi  2023-05-05        16721.78
36             Taxi  2023-05-06        21488.29
37             Taxi  2023-05-07        25493.92
38             Taxi  2023-05-08        26134.58
39             Taxi  2023-05-09        26898.37
40             Taxi  2023-05-10        31348.49
41             Taxi  2023-05-11        33598.64
42             Taxi  2023-05-12        36179.62
43             Taxi  2023-05-13        42096.40
44             Taxi  2023-05-14        42096.40
45             Taxi  2023-05-15        46925.79
46             Taxi  2023-05-16        46925.79
47             Taxi  2023-05-17        52880.75
48             Taxi  2023-05-18        54286.59
49             Taxi  2023-05-19        55648.81
50             Taxi  2023-05-20        55648.81
51             Taxi  2023-05-21        55648.81
52             Taxi  2023-05-22        61799.42
53             Taxi  2023-05-23        64781.23
54             Taxi  2023-05-24        70614.99
55             Taxi  2023-05-25        71479.53
56             Taxi  2023-05-26        71748.73
57             Taxi  2023-05-27        82149.27
58             Taxi  2023-05-28        87085.91
59             Taxi  2023-05-29        87898.42
60             Taxi  2023-05-30        93756.98
61             Taxi  2023-05-31        93756.98

# Task: 5

In [15]:
display_tables(['fact_events'])

fact_events (500, 6)

,id,event_ts,user_id,business_domain,client_id,event_name
0,1,2023-07-12 08:17:20.130592,1745,SuperApp,desktop,word
1,2,2023-12-10 17:27:41.479502,1560,Taxi,desktop,themselves
2,3,2023-09-18 03:44:50.794449,1549,Taxi,mobile,laugh
3,4,2023-09-28 00:34:52.945212,1742,SuperApp,mobile,environment
4,5,2023-07-29 07:09:47.885577,1188,SuperApp,mobile,eye

Представьте, что у вас есть лог событий по пользователям, у которых сквозной идентификатор по всем направлениям  бизнеса экосистемы корпорации (такси, суперапп, марткетплейс и т.д.) <br>
Напишите запрос, который возвращает приложение (столбец  business_domain ) с наибольшим числом пользователей, которые использовали только desktop. Пользователей, которые использовали хотя бы одно из мобильных приложений экосистемы нужно исключить.

In [16]:
query5 = text("""
WITH user_flags AS (
    SELECT
        fact_events.user_id,
        MAX(CASE WHEN fact_events.client_id = 'mobile' THEN 1 ELSE 0 END) AS has_mobile,
        MAX(CASE WHEN fact_events.client_id = 'desktop' THEN 1 ELSE 0 END) AS has_desktop
    FROM fact_events
    GROUP BY
        fact_events.user_id
),

desktop_only_users AS (
    SELECT
        user_flags.user_id
    FROM user_flags
    WHERE user_flags.has_desktop = 1
      AND user_flags.has_mobile = 0
),

user_domains AS (
    SELECT DISTINCT
        fact_events.user_id,
        fact_events.business_domain
    FROM fact_events
    JOIN desktop_only_users
        ON fact_events.user_id = desktop_only_users.user_id
)

SELECT
    user_domains.business_domain,
    COUNT(user_domains.user_id) AS desktop_only_users
FROM user_domains
GROUP BY
    user_domains.business_domain
ORDER BY
    desktop_only_users DESC
LIMIT 1;
""")

df5 = pd.read_sql(query5, engine)
df5

  business_domain  desktop_only_users
0            Taxi                  73

# Answers export

In [17]:
# создаём директорию, если ещё нет
os.makedirs("query", exist_ok=True)

# словарь с переменными-запросами
queries = {
    "1.1 Доставляемость по кампании.sql": query1_1,
    "1.2 Доставляемость по каналу.sql": query1_2,
    "2. Определить сессии пользователей.sql": query2,
    "3. Определить топ событий заканчивающих сессию.sql": query3,
    "4.1 Кумулятивная сумма по клиенту.sql": query4_1,
    "4.2 Кумулятивная сумма по приложению.sql": query4_2,
    "5. Приложение с наибольшим числом пользователей.sql": query5
}

# сохраняем каждый запрос в отдельный файл
for filename, sql_text in queries.items():
    with open(os.path.join("query", filename), "w") as f:
        f.write(sql_text.text.strip())

os.listdir("query")

['5. Приложение с наибольшим числом пользователей.sql',
 '4.1 Кумулятивная сумма по клиенту.sql',
 '1.2 Доставляемость по каналу.sql',
 '3. Определить топ событий заканчивающих сессию.sql',
 '4.2 Кумулятивная сумма по приложению.sql',
 '2. Определить сессии пользователей.sql',
 '1.1 Доставляемость по кампании.sql']

In [18]:
!open .